const headers = ["Название", "Тип кузова", "Поколение", "Год начала выпуска", "Год конца выпуска", "Цена"];

let table_data = [
    ['Polo', 'Седан', 'V рестайлинг', '2014', '2020', '1910000'],
    ['Polo', 'Хэтчбэк', 'VI рестайлинг', '2021', '-', '1390000'],
    ['Polo', 'Лифтбек', 'VI', '2020', '-', '570000'],
    ['Polo', 'Хэтчбэк', 'VI', '2017', '2021', '1370000'],
    ['Polo', 'Хэтчбэк', 'III ресстайлинг', '1999', '2001', '820000'],
    ['Tiguan', 'Внедорожник', 'II рестайлинг', '2020', '-', '650000'],
    ['Tiguan', 'Внедорожник', 'II', '2016', '2020', '1060000'],
    ['Tiguan', 'Внедорожник', 'I рестайлинг', '2011', '2018', '880000'],
    ['Tiguan', 'Внедорожник', 'I', '2007', '2011', '1700000'],
    ['Golf', 'Универсал', 'VIII', '2019', '-', '1750000'],
    ['Golf', 'Универсал', 'VII рестайлинг', '2017', '-', '1340000'],
    ['Golf', 'Универсал', 'VII', '2012', '2017', '810000'],
    ['Golf', 'Универсал', 'VI', '2008', '2012', '1790000'],
    ['Golf', 'Универсал', 'V', '2003', '2009', '1510000'],
    ['Beetle', 'Хэтчбэк', 'II', '2011', '2019', '1860000'],
    ['Beetle', 'Кабриолет', 'II', '2011', '2019', '1630000'],
    ['Beetle', 'Хэтчбэк', 'I рестайлинг', '2005', '2010', '1370000'],
    ['Beetle', 'Кабриолет', 'I рестайлинг', '2005', '2010', '1370000'],
    ['Beetle', 'Хэтчбэк', 'I', '1997', '2005', '670000'],
    ['Beetle', 'Кабриолет', 'I', '1997', '2005', '1430000'],
]